#define  _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

//我写的第一个Switch语句，这个是最简单的应该
//int main()
//{
//	int a = 0;
//	scanf("%d", &a);
//	switch (a)
//	{
//	case 1:
//	case 2:
//	case 3:
//	case 4:
//	case 5:
//		printf("weekday");
//		break;
//	case 6:
//	case 7:
//		printf("weekend");
//		break;
//	}
//	return 0;
//}

//打印1——10的整数
//int main()
//{
//	int a = 1;
//	while (a <= 10)
//	{
//		printf("%d ", a);
//		a++;
//	}
//	return 0;
//}

//有了“continue”的情况
//int main()
//{
//	int i = 1;
//	while (i <= 10)
//	{
//		i++;
//		if (5 == i)
//		{
//			continue;
//		}
//		printf("%d ", i);
//	}
//	return 0;
//}

//int main()
//{
//	int ch = 0;
//	while ((ch = getchar()) != EOF)       //这里有地方需要注意的是：这是个“循环语句”，所以，无论自己打出多少字符都会被打印出来，
//	{                                     //只不过我输入了7个字符，那就直接调用14次getchar 和 putchar函数。因为还有“空格”代表的\n。
//		putchar(ch);                      //用Crtl+z停止。
//	}									  //有时候按三次Crtl+z才能停止，这个是一个小bug，不用太在意。
//	return 0;							
//}

//int main()
//{
//	char password[20] = { 0 };
//	printf("请输入密码:");
//	scanf("%s", password);
//	printf("请确认密码(Y/N):");          //这时候无论输入的是什么都会直接输出“No”因为getchar会将"\n"直接读取，所以就直接进入到了else。
////////////////////////////////	getchar();
//	int ret = getchar();				//这时候直接输入再输入一个“getchar”就行，但是这种方法非常低效。
//	if ('Y' == ret)
//	{
//		printf("Yes\n");
//	}
//	else
//	{
//		printf("No\n");
//	}
//
//	return 0;
//}

//int main()
//{
//	char password[20] = { 0 };
//	printf("请输入密码:");
//	scanf("%s", password);
//	printf("请确认密码(y/n):");          
//	int ch = 0;
//	while ((ch = getchar()) != '\n')					//用一个while循环语句，然后直接进行读取，知道读取到“\n”，就能进行没有限制的输入了
//	{
//		;
//	}
//	int ret = getchar();				
//	if ('y' == ret)
//	{
//		printf("yes\n");
//	}
//	else
//	{
//		printf("no\n");
//	}
//
//	return 0;
//}

//int main()
//{
//	char ch = '\0';
//	while ((ch = getchar()) != EOF)
//	{
//		if (ch < '0' || ch > '9')      //要好好使用“监视”功能，监视功能可以让自己看清楚代码是“如何运转”的。
//			continue;
//		putchar(ch);
//	}
//	return 0;
//}

/*小明和小华的年龄之和是m
岁。n年后，小明的年龄将
是小华年龄的两倍。请问小
明和小华现在各有多少岁 ?*/
//int main()
//{
//	int x, y, m, n;
//	scanf("%d", &m);
//	scanf("%d", &n);
//	y = (m - n) / 3;
//	x = 2 * m / 3  + 1 * n / 3 ; 
//	if (0 != x && 0 != y &&  0 == m % 3 && n%3 == 0 && m == 2 * n)  //一定要有限定条件，因为这个的条件是决定性的，
//		printf("小明年龄为%d岁 小华年龄为%d岁", x, y);                 //毕竟年龄一点是整数，而且是正整数，而且“m”和“n”之间也是有关系的。
//	else
//		printf("错误");
//	return 0;
//}

//int main()
//{
//	int m, n, x, y;
//	scanf("%d", &m);
//	scanf("%d", &n);
//	x = 1 * m / 3  + 1 * n / 3 ;               //1/3m +1/3n 就是这样表达的，这样可以进行直接表示。
//	printf("%d", y);                          // x = 1 * m / 3  + 1 * n / 3 ;
//	return 0;
//}

/*给定N个正整数，请统计奇数和偶数各有多少个？

输入格式：
输入第一行给出一个正整数：N（≤1000）；第2行给出n个非负整数，以空格分隔。

输出格式：
在一行中先后输出奇数的个数、偶数的个数。中间以1个空格分隔。*/
//int main()
//{
//    int N = 0;
//    int n = 0;
//    int j = 0;
//    int s = 0;
//    scanf("%d", &N);                          //先写一个“N”，“N”的意思是自己想要判断多少个数字是“技术和偶数”
//
//    for (int i = 0; i < N; i++)              //随便定义一个“i”，这个“i”以后永远不会出现，因为“i”只是用来帮助这个代码进入循环的的东西。
//    {                                        //这个“i ”的意义是能输入几个数字，或者说是“循环几次”，N = 循环次数。
//
//        scanf("%d", &n);                       //然后用“n”代表自己“输入”的数字。
//        if (n % 2 == 0)                        //但是“n”每次只用一次，然后看自己输入了几个数字，n就能输入几次。
//        {
//            s++;//偶数的个数                  //然后用if else语句判断是“偶数还是奇数”
//        }                                      //因为最开始设置的是s和j都 = 0；所以后面会自动进行增加。
//        else 
//        {
//            j++;//奇数的个数
//        }
//    }
//    printf("%d %d", j, s);
//    return 0;
//}

//打印9 * 9 乘法表
//int main()
//{
//    int i, j, n;
//    scanf("%d", &n);
//    for (i = 1; i <= n; i++)                     //一定要理解好各个符号的意思和意义。
//    {                                            // 这个是一个“双重循环”一定要理解了。
//        for (j = 1; j <= i; j++)                 //“++”的意思是先给“b”一个值“a”，然后再让“a加上1”
//        {
//            printf("%d*%d=%-4d", j, i, i * j);          //“-4d”的意思是“对一个变量来说，这个“变量”占位“4个空格”的距离。
//        }                                               //这样就可以保证整体的美观整洁性。
//        printf("\n");                                  //说白了就是在利用这个for循环的“嵌套特性”，让“i”循环一次的时候，“j”可以循环“i”次
//    }
//    return 0;
//}
 
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//// 阶乘的运算
//int main()
//{
//    int n;
//    int i;
//    int s = 1, S = 0;
//    scanf("%d", &n);
//    for (i = 1; i <= n; i++)
//    {
//        s = s * i;       //阶乘的表达式。（每个阶乘的表达式）          // “for循环”我觉得还是有点不好理解的，自己还是要多多写一下运算式，才能更好理解“for循环”。
//        S = S + s;      // 阶乘的求和。
//    }
//    printf("%d", S);
//}

////计算数字的平方和
//int main()
//{
//	int a, b, c, d = 0;
//	scanf("%d", &a);
//	for (b = 1; b <= a; b++) 
//	{
//		c = b * b;                //这个题目和上面的题目是一样的，说白了就是先进行“单个运算”的进行，然后
//		d = d + c;                //进行“累加”求和。
//	}
//	printf("%d", d);
//	return 0;
//}
// 在上面两个题目中，注意要运用“迭代”的思想，第一步进行“单个运算”的时候，用的就是“迭代”的思想。
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


//int main()
//{
//	int N, i, s;
//	float sum;
//	scanf("%d", N);
//	for (i = 1; i <= N; i++)
//	{
//		s = i - (i + 1) / (i + 2);
//	}
//
//
//	return 0;
//}

//int main()
//{
//    int a = 1, b = 1, flag = 1;
//    double sum = 0;
//    int n;
//    scanf("%d", &n);
//    for (int i = 1; i <= n; i++)
//    {
//        sum += a * 1.0 * flag / b;          //这里的浮点数的运算是有点不一样的， “a和b”都是int类型的，但是我需要输出的是float类型的，
//        flag++;//控制分子
//        a = -a;//这里的作用是为了显示+-交替
//        b += 2;
//    }
//    printf("%.3lf", sum);
//}

// 写代码 == 办法（编程思维） + 写代码（按照语法形式去写）
//编程思维是需要训练的。（用计算机的思维去解决问题）

//计算“n”的阶乘
// 思路：先想好“n”的阶乘是什么：n！= 1 * 2 * 3......* 
//int main()
//{
//	int n = 1, N, a = 0;
//	scanf("%d", &N);
//	for (int i = 1; i <= N; i++)
//	{
//		n *= i;    // 这个算式的意思是进行无论输入多大的数字，以前的数字都是要重新乘一遍的，所以才能进行阶乘的计算
//		a += n;
//	}
//	printf("%d", a);
//	return 0;
//}

/* praise1.c -- uses an assortment of strings */
//#include <stdio.h>
//#define PRAISE "You are an extraordinary being."
//int main(void)
//{
//    char name[40];
//
//    printf("What's your name? ");
//    scanf("%s", name);
//    printf("Hello, %s. %s\n", name, PRAISE);
//
//    return 0;
//}

//int main()
// {
//    int i, sum = 0, x, n = 8;
//    float y;
//    for (i = 1; i <= n; i++) 
//    {
//        scanf("%d ", &x);
//        sum += x;
//    }
//    y = sum * 1.0 / 8;             //要是没有“1.0”这个数字，那么我自己输出来的是整数，因为这一步中“sum / 8”是整数，
//    printf("%.2f\n", y);            //但是我想要的是“浮点数类型”
//    return 0;
//}
//
//int main()
//{
//    float c, a, b;
//    scanf("%f %d", &a, &b);
//    c = a / b;                    //这里的“a和b”都是“int类型”，然后进行运算的时候运行出来的结果是“int类型”
//    c = a * 1.0 / b;              //也就是说：算出来的东西和接收的东西是分开的。例子：3 / 2 == 1.5，但是“整数运算”出来的是“1”
//    printf("%.1f", c);            //接收的“c”虽然是浮点数类型，但是它将接收的是“1”也就是说转化出来的的是“1.0”。
//    return 0;
//}

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
////1. 求“100——200之间素数”使用“遍历”的方法
//int main()
//{
//	int i, j;
//	int flag = 0;
//	int count1 = 0;
//	int count2 = 0;
//	for (i = 100; i <= 200; i++)
//	{
//		for (j = 2; j < i; j++)          //素数的意思是只有1和其本身能将自己除尽。
//			//但是这里我有一个不理解的地方，这个for循环中“j<=i”这个时候不是把j=i了吗？应该除尽了，但是没有除尽
//			//而且我重新试了一下“j<i”这样也是没问题的，而且这两种形式连“循环次数”都没有变，理解不了。
//		{
//			if (i % j == 0)            //这个式子的意义是“输入一个i，然后让j从2开始一直和i整除，知道j增加到i。
//			{
//				break;
//			}
//			count1++;
//		}
//		count2++;
//		if (i == j)                     // 这个时候内层的“for循环”已经运行完了，只用运行“外层的if语句”了
//			printf("%d  ", i);    
//	}
//	printf("\n内层count=%d", count1);
//	printf("\n外层count=%d", count2);
//	return 0;
//}
//2. 优化1：减少遍历的长度
//int main()
//{
//	int i, j;
//	int flag = 0;
//	//int count1 = 0;
//	//int count2 = 0;
//	for (i = 100; i <= 200; i++)
//	{
//		for (j = 2; j < (i / 2); j++)
//		{
//			if (i % j == 0)
//			{
//				break;
//			}
//			//count1++;
//		}
//		//count2++;
//		if (j >= i / 2)
//			printf("%d  ", i);
//	}
//	//printf("\n内层count=%d", count1);
//	//printf("\n外层count=%d", count2);
//	return 0;
//}

//3.优化2：剔除偶数
int main()
{
	int i = 0, j = 0;
	int count = 0;
	for (i = 101; i <= 200; i += 2)
	{
		int j = 0;
		for (j = 2; j <= i - 1; j++)
		{
			if (i % j == 0)
			{
				break;
			}
		}
		if (i == j)
		{
			printf("%d ", i);
			count++;
		}
	}
	printf("\ncount = %d\n", count);

	return 0;
}























